app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "orders"
---
  def index

    @orders = Order.paginate(:page => params[:page], :per_page => 2)

SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", "37"]]
SELECT "rides".* FROM "rides" WHERE "rides"."id" = ? LIMIT 1  [["id", 12]]
SELECT "users".* FROM "users" WHERE "users"."id" = 13 LIMIT 1
---
  def show
    @order = Order.find(params[:id])

    @ride = Ride.find @order.ride_id

    @user = User.find @order.user_id

SELECT "rides".* FROM "rides" WHERE "rides"."id" = ? LIMIT 1  [["id", "12"]]
---
  def new
    @order = Order.new
  @ride = Ride.find(params[:oid])

SELECT "rides".* FROM "rides" WHERE "rides"."id" = ? LIMIT 1  [["id", "12"]]
INSERT INTO "orders" ("created_at", "payment", "price", "quantity", "ride_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
UPDATE "orders" SET "user_id" = 13, "updated_at" = '2013-12-18 11:05:29.724852' WHERE "orders"."id" = 37
---
  def create
   @ride = Ride.find params[:order][:ride_id]
    if @ride
       @order = @ride.orders.create params[:order]
       @order.user_id = @current_user.id  # sets the user_id fk
       @order.save       # saves to the post table