app/controllers/rides_controller.rb

SELECT "rides".* FROM "rides" LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "rides"
---
  def index

  	@rides = Ride.paginate(:page => params[:page], :per_page => 2)